#include <stdio.h> // Підключення Бібліотек
#include <math.h>

int main() {
  int a, b;
  float x1, x2, x3;
  printf("Задайте два цілих числа:\n");

  printf("\nВведіть перше число: ");
  scanf("%d", &a);

  printf("Введіть друге число: ");
  scanf("%d", &b);

  // Обчислення
  x1 = a % b;
  x2 = b - a;
  x3 = pow(a,2) + pow(b,2);

  // Відповідь

  printf("\n***Результати***\n");

  printf("Число 1 = %d\n", a);
  printf("Число 2 = %d\n\n", b);

  printf("Залишок ділення першого числа на друге = %.f\n", x1);
  printf("Різниця другого та першого числа = %.f\n", x2);
  printf("Сума квадратів першого та другого числа = %.f\n", x3);

  return 0;
}
